{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "units": 6, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_33", 0, 0, {}]]]}, {"name": "dense_35", "class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "units": 4, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 0.0}}, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_34", 0, 0, {}]]]}, {"name": "dense_36", "class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_35", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["dense_36", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}